quest_system_1461752797_name=^?^The Titan's Tear
quest_system_1461752797_stage_0=^?^Use the captain's map to find the treasure.
quest_system_1461752797_stage_1=^?^The Titan's Tear has been found! You should bring it back to the dwarves.
quest_system_1461752797_task=^?^Fulfill the dying request of Captain Monte Rodriges. Use the map to find the hidden treasure, and bring it to the dwarves in Upper Hadar, to the Stone Darillas Tavern.<br>[reward]
